; +----------------------------------------------------------------------------+
;                НАСТРОЙКИ УДАЛЁННЫХ РЕПОЗИТОРИЕВ ПАКЕТОВ EMACS
; +----------------------------------------------------------------------------+
; Определяем репозитории пакетов
(require 'package)
(setq package-archives
      '(("GNU ELPA"     . "https://elpa.gnu.org/packages/")
        ("MELPA Stable" . "https://stable.melpa.org/packages/")
        ("MELPA"        . "https://melpa.org/packages/"))
; Устанавливаем приоритет репозиториев на случай если какие-то недоступны
      package-archive-priorities
      '(("GNU ELPA"     . 10)
        ("MELPA Stable" . 5)
        ("MELPA"        . 0)))
; Загружаем установленные пакеты
(package-initialize)

; +----------------------------------------------------------------------------+
;                           УСТАНОВКА ПАКЕТОВ EMACS
; +----------------------------------------------------------------------------+
; Устанавливаем цветовую тему по-умолчанию
(use-package apropospriate-theme
  :ensure t
  :config 
  (load-theme 'apropospriate-dark t))

; +----------------------------------------------------------------------------+
;               НАСТРОЙКА ОБЩИХ ГЛОБАЛЬНЫХ НАСТРОЕК ПО-УМОЛЧАНИЮ
; +----------------------------------------------------------------------------+
; Настройки глобальных переменных
(custom-set-variables
 ; Включить отображение номеров строк
 '(global-display-line-numbers-mode t)
 ; Отключаем приветственный экран Emacs -> при запуске будет открываться черновик
 '(inhibit-startup-screen t)
 ; Устанавливаем пустым изначальный текст черновика
 '(initial-scratch-message "")
 ; ???
 '(package-selected-packages '(apropospriate-theme use-package))
 ; Отключаем полосу прокрутки
 '(scroll-bar-mode nil)
 ; Отключаем панель инструментов
 '(tool-bar-mode nil)
 '(column-number-mode t))

; Устанавливаем шрифт по-умолчанию
(custom-set-faces
 '(default ((t (:family "IBM Plex Mono"
		:foundry "IBM "
		:slant normal
		:weight normal
		:height 143
		:width normal)))))
; +----------------------------------------------------------------------------+
;                             НАСТРОЙКИ ORG-MODE
; +----------------------------------------------------------------------------+



